node {
  name: "Input/Inputs"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Target/Targets"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2
        }
      }
    }
  }
}
node {
  name: "ModCosh/cosh/Cosh"
  op: "Cosh"
  input: "Input/Inputs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal"
  op: "Add"
  input: "ModCosh/Convolution/random_normal/mul"
  input: "ModCosh/Convolution/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution/conv_weights"
  input: "ModCosh/Convolution/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/ModCosh/Convolution/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution/ModCosh/Convolution/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/ModCosh/Convolution/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution/ModCosh/Convolution/conv_weights_0/tag"
  input: "ModCosh/Convolution/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 32
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution/random_normal_1/mul"
  input: "ModCosh/Convolution/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution/conv_biases"
  input: "ModCosh/Convolution/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution/Conv2D"
  op: "Conv2D"
  input: "ModCosh/cosh/Cosh"
  input: "ModCosh/Convolution/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution/add"
  op: "Add"
  input: "ModCosh/Convolution/Conv2D"
  input: "ModCosh/Convolution/conv_biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Activation/Relu6"
  op: "Relu6"
  input: "ModCosh/Convolution/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_1/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution_1/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution_1/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal"
  op: "Add"
  input: "ModCosh/Convolution_1/random_normal/mul"
  input: "ModCosh/Convolution_1/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_1/conv_weights"
  input: "ModCosh/Convolution_1/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_1/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution_1/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_1/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/ModCosh/Convolution_1/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution_1/ModCosh/Convolution_1/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/ModCosh/Convolution_1/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution_1/ModCosh/Convolution_1/conv_weights_0/tag"
  input: "ModCosh/Convolution_1/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 32
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_1/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution_1/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution_1/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution_1/random_normal_1/mul"
  input: "ModCosh/Convolution_1/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_1/conv_biases"
  input: "ModCosh/Convolution_1/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_1/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_1/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution_1/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_1/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_1/Conv2D"
  op: "Conv2D"
  input: "ModCosh/Activation/Relu6"
  input: "ModCosh/Convolution_1/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_1/add"
  op: "Add"
  input: "ModCosh/Convolution_1/Conv2D"
  input: "ModCosh/Convolution_1/conv_biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Activation_1/Relu6"
  op: "Relu6"
  input: "ModCosh/Convolution_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Pooling/MaxPool"
  op: "MaxPool"
  input: "ModCosh/Activation_1/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "ModCosh/cosh_1/Cosh"
  op: "Cosh"
  input: "ModCosh/Pooling/MaxPool"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_2/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution_2/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution_2/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal"
  op: "Add"
  input: "ModCosh/Convolution_2/random_normal/mul"
  input: "ModCosh/Convolution_2/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_2/conv_weights"
  input: "ModCosh/Convolution_2/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_2/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution_2/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_2/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/ModCosh/Convolution_2/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution_2/ModCosh/Convolution_2/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/ModCosh/Convolution_2/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution_2/ModCosh/Convolution_2/conv_weights_0/tag"
  input: "ModCosh/Convolution_2/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_2/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution_2/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution_2/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution_2/random_normal_1/mul"
  input: "ModCosh/Convolution_2/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_2/conv_biases"
  input: "ModCosh/Convolution_2/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_2/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_2/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution_2/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_2/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_2/Conv2D"
  op: "Conv2D"
  input: "ModCosh/cosh_1/Cosh"
  input: "ModCosh/Convolution_2/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_2/add"
  op: "Add"
  input: "ModCosh/Convolution_2/Conv2D"
  input: "ModCosh/Convolution_2/conv_biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Activation_2/Relu6"
  op: "Relu6"
  input: "ModCosh/Convolution_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_3/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution_3/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution_3/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal"
  op: "Add"
  input: "ModCosh/Convolution_3/random_normal/mul"
  input: "ModCosh/Convolution_3/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_3/conv_weights"
  input: "ModCosh/Convolution_3/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_3/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution_3/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_3/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/ModCosh/Convolution_3/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution_3/ModCosh/Convolution_3/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/ModCosh/Convolution_3/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution_3/ModCosh/Convolution_3/conv_weights_0/tag"
  input: "ModCosh/Convolution_3/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_3/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution_3/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution_3/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution_3/random_normal_1/mul"
  input: "ModCosh/Convolution_3/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_3/conv_biases"
  input: "ModCosh/Convolution_3/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_3/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_3/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution_3/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_3/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_3/Conv2D"
  op: "Conv2D"
  input: "ModCosh/Activation_2/Relu6"
  input: "ModCosh/Convolution_3/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_3/add"
  op: "Add"
  input: "ModCosh/Convolution_3/Conv2D"
  input: "ModCosh/Convolution_3/conv_biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Activation_3/Relu6"
  op: "Relu6"
  input: "ModCosh/Convolution_3/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Pooling_1/MaxPool"
  op: "MaxPool"
  input: "ModCosh/Activation_3/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "ModCosh/cosh_2/Cosh"
  op: "Cosh"
  input: "ModCosh/Pooling_1/MaxPool"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000@\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_4/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution_4/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution_4/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal"
  op: "Add"
  input: "ModCosh/Convolution_4/random_normal/mul"
  input: "ModCosh/Convolution_4/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 64
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_4/conv_weights"
  input: "ModCosh/Convolution_4/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_4/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution_4/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_4/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/ModCosh/Convolution_4/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution_4/ModCosh/Convolution_4/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/ModCosh/Convolution_4/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution_4/ModCosh/Convolution_4/conv_weights_0/tag"
  input: "ModCosh/Convolution_4/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_4/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution_4/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution_4/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution_4/random_normal_1/mul"
  input: "ModCosh/Convolution_4/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_4/conv_biases"
  input: "ModCosh/Convolution_4/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_4/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_4/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution_4/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_4/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_4/Conv2D"
  op: "Conv2D"
  input: "ModCosh/cosh_2/Cosh"
  input: "ModCosh/Convolution_4/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_4/add"
  op: "Add"
  input: "ModCosh/Convolution_4/Conv2D"
  input: "ModCosh/Convolution_4/conv_biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Activation_4/Relu6"
  op: "Relu6"
  input: "ModCosh/Convolution_4/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\200\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_5/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal/mul"
  op: "Mul"
  input: "ModCosh/Convolution_5/random_normal/RandomStandardNormal"
  input: "ModCosh/Convolution_5/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal"
  op: "Add"
  input: "ModCosh/Convolution_5/random_normal/mul"
  input: "ModCosh/Convolution_5/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_weights"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 128
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_weights/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_5/conv_weights"
  input: "ModCosh/Convolution_5/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_5/conv_weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_weights/read"
  op: "Identity"
  input: "ModCosh/Convolution_5/conv_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_5/conv_weights"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/ModCosh/Convolution_5/conv_weights_0/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "ModCosh/Convolution_5/ModCosh/Convolution_5/conv_weights_0"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/ModCosh/Convolution_5/conv_weights_0"
  op: "HistogramSummary"
  input: "ModCosh/Convolution_5/ModCosh/Convolution_5/conv_weights_0/tag"
  input: "ModCosh/Convolution_5/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 128
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "ModCosh/Convolution_5/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1/mul"
  op: "Mul"
  input: "ModCosh/Convolution_5/random_normal_1/RandomStandardNormal"
  input: "ModCosh/Convolution_5/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/random_normal_1"
  op: "Add"
  input: "ModCosh/Convolution_5/random_normal_1/mul"
  input: "ModCosh/Convolution_5/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_biases"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_biases/Assign"
  op: "Assign"
  input: "ModCosh/Convolution_5/conv_biases"
  input: "ModCosh/Convolution_5/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_5/conv_biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "ModCosh/Convolution_5/conv_biases/read"
  op: "Identity"
  input: "ModCosh/Convolution_5/conv_biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ModCosh/Convolution_5/conv_biases"
      }
    }
  }
}
node {
  name: "ModCosh/Convolution_5/Conv2D"
  op: "Conv2D"
  input: "ModCosh/Activation_4/Relu6"
  input: "ModCosh/Convolution_5/conv_weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
