name: "add"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 51 dim: 31 } }
}

layer {
  name: "data2"
  type: "Input"
  top: "data2"
  input_param { shape: { dim: 51 dim: 31 } }
}

layer {
  name: "add"
  type: "Add"
  top: "add"
  bottom: "data"
  bottom: "data2"
}
