name: "threshold"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 2 dim: 2 dim: 2 } }
}

layer {
  name: "addpad"
  type: "AddPad"
  top: "addpad"
  bottom: "data"
  addpad_param {
    pad: 1
  }
}
