name: "Convolution"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 224 dim: 224 } }
}
layer {
  name: "conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/7x7_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    mean_value: 104
    mean_value: 117
    mean_value: 123
    #mean_file: "imagenet_mean.binaryproto"
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
  #bottom_mlu_dtype {
  #  position: 1
  #  scale: 1.7278912
  #}
  #blobs_dtype {
  #  type: DT_FIX8
  #  position: -6
  #  scale: 1.6485597
  #}
}
