name: "deconv"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 128 dim: 24 dim: 32 }
  }
}
layer {
  name: "prob"
  type: "Deconvolution"
  bottom: "data"
  top: "prob"
  convolution_param {
    num_output: 128
    kernel_size: 4
    pad: 0
    stride: 2
    group: 128
    weight_filler {
      type: "xavier"
    }
  }
}
