name: "elu"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 32 dim: 2 dim: 2 } }
}

layer {
  name: "elu"
  type: "ELU"
  top: "elu"
  bottom: "data"
  elu_param {
    alpha: 1
  }
}
