name: "flatten"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 38 dim: 38 dim: 12 } }
}

layer {
  name: "flat"
  type: "Flatten"
  top: "flat"
  bottom: "data"
}
