name: "default"
layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 4
      dim: 320
      dim: 320
    }
  }
}
layer {
  name: "crop"
  type: "MLUImagecrop"
  bottom: "data"
  top: "crop_data"
  image_crop_param {
    crop_x: 0
    crop_y: 0
    crop_h: 224
    crop_w: 224
  }
}
