name :"permute_net"
layer{
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: {dim: 1 dim: 4 dim: 416 dim: 416 } }
}

layer {
  name: "perm1"
  type: "Permute"
  bottom: "data"
  top: "perm1"
  permute_param {
    order: 0
    order: 3
    order: 1
    order: 2
    use_image: true
  }
}
