name: "threshold"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 4 dim: 234 dim: 416 } }
}

layer {
  name: "addpad"
  type: "AddPad"
  top: "addpad"
  bottom: "data"
  addpad_param {
    pad_h: 91
  }
}
