name: "mlp"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 50 dim: 4 dim: 4 } }
}

layer {
  name: "mlp"
  type: "InnerProduct"
  top: "mlp"
  bottom: "data"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
