name :"permute_net"
layer{
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: {dim: 1 dim: 5 dim: 3 dim: 4} }
}

layer {
  name: "perm1"
  type: "Permute"
  bottom: "data"
  top: "perm1"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
