name: "power"
layer{
	name:"data"
	type:"Input"
	top:"data"
	input_param{shape:{dim:3 dim:32 dim:2 dim:2 }}
}

layer{
	name:"power"
	type:"Power"
	top:"power"
	bottom:"data"
	power_param{
            shift: 100
            power: 1.1
        }
}
