name: "relu_net"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 64 dim: 1  dim: 28 dim: 28 } }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "data"
  top: "data"
}
