name: "Scale"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 6 dim: 16 dim: 18 } }
}
layer {
  name: "Scale1"
  type: "Scale"
  bottom: "data"
  top: "Scale1"
  scale_param {
     bias_term: true
  }
}
