name: "shufflechannel"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim:120 dim: 15 dim: 5 dim:2} }
}

layer {
  name: "ShuffleChannel"
  type: "ShuffleChannel"
  top: "shufflechannel"
  bottom: "data"
  shuffle_channel_param{
    group:3
  }
}
