name: "softmax"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 8 dim: 125 dim: 15 dim: 15 } }
}

layer {
  name: "prob"
  type: "Softmax"
  top: "prob"
  bottom: "data"
}
