name: "LeNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 32 dim: 2 dim: 2 } }
}

layer {
  name: "data2"
  type: "Input"
  top: "data2"
  input_param { shape: { dim: 1 dim: 32 dim: 2 dim:2 } }
}

layer {
  name: "sub"
  type: "Sub"
  top: "sub"
  bottom: "data"
  bottom: "data2"
}
