name: "threshold"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 32 dim: 2 dim: 2 } }
}

layer {
  name: "threshold"
  type: "Threshold"
  top: "threshold"
  bottom: "data"
  threshold_param {
    threshold: 1
  }
}
