name: "tile"
layer{
	name:"data"
	type:"Input"
	top:"data"
	input_param{shape:{dim:3 dim:32 dim:12 dim:12 }}
}

layer{
	name:"tile"
	type:"Tile"
	top:"tile"
	bottom:"data"
  tile_param {
    axis: 2
    tiles: 2
  }
}
