name: "pool_net"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 4 dim: 1 dim: 4 dim: 4 } }
}
layer {
  name: "unpool"
  type: "UnPooling"
  bottom: "data"
  top: "result"
  unpooling_param{
    unpool: FIXED
    out_kernel_size: 2
    out_stride: 2
  }
}
